snlkuharlocal/src/Documents/РазработкаНовойНоменклатуры/РазработкаНовойНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазработкаНовойНоменклатуры</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделенияПродажи</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПоставкиНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолоВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.ПоловозрастныеПризнакиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.ФР_Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>СырьеваяСоставляющая</name>
    <type>
      <types>CatalogRef.МатериалыСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>РазменрныйРяд</name>
    <type>
      <types>CatalogRef.Размеры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЦветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПапкуАналитическихДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПродукции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоАналога</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицоПЗО</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйПериодПроведенияАссортиментногоКомитета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыполнения</name>
    <type>
      <types>CatalogRef.СтатусыВыполненияРазработкиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПолученияОбразцов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаПолученияОбразцов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПолученияФото</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХудожетсвенноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеференсУпаковки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РеференсФотоСессии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаПоставкиНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяСтадияДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДизайнМакет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАртикула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.КоллекцииДляСайта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.ТипыТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>WB_СПП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>WB_СПП_А</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СезоннаяКоллекция</name>
    <type>
      <types>CatalogRef.СезоннаяКоллекция</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаТайминга</name>
    <type>
      <types>CatalogRef.ЭтапыРазработкиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.МаршрутыЭтаповТаймингаРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьМодели</name>
    <type>
      <types>EnumRef.УникальностьПроизводстваМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусМодели</name>
    <type>
      <types>EnumRef.СтатусыПроизводстваМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАссортимента</name>
    <type>
      <types>EnumRef.СтатусыАссортимента</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДостаки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговоеКоличествоЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDСтатус</name>
    <type>
      <types>EnumRef.LDСтатус</types>
    </type>
  </attributes>
  <attributes>
    <name>LDПлан1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDПлан2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDПлан3</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDФакт1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDФакт2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDФакт3</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LDКомментарий1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LDКомментарий2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LDКомментарий3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбразца</name>
    <type>
      <types>EnumRef.СтатусыОбразцов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецКомментарий1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецКомментарий2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецКомментарий3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PPSСтатус</name>
    <type>
      <types>EnumRef.PPSСтатус</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтгрузки</name>
    <type>
      <types>EnumRef.СтатусОтгрузкиМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОтгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АссортиментныйКомитет</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.АссортиментныйКомитет</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыАссортиментногоКомитета</types>
      </type>
    </attributes>
    <attributes>
      <name>Активен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокРазмеров</name>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.Размеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсходникиФотоСессий</name>
    <attributes>
      <name>Папка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Презентации</name>
    <attributes>
      <name>Папка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МакетыУпаковки</name>
    <attributes>
      <name>Папка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тайминг</name>
    <attributes>
      <name>ЭтапРазработки</name>
      <type>
        <types>CatalogRef.ЭтапыРазработкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетнаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СостоянияДляЗаявок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусыАссортиментногоКомитета/СтатусыАссортиментногоКомитета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыАссортиментногоКомитета</name>
  <enumValues>
    <name>ПринятьВПоизводство</name>
  </enumValues>
  <enumValues>
    <name>ПринятьКДороботке</name>
  </enumValues>
  <enumValues>
    <name>ПрекратитьРазработку</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияДляЗаявок/СостоянияДляЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДляЗаявок</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ЭтапыРазработкиНоменклатуры/ЭтапыРазработкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыРазработкиНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Маршрут</name>
      <type>
        <types>CatalogRef.МаршрутыЭтаповТаймингаРазработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/РазработкаНовойНоменклатуры/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ТекущийДокАссортиментныйКомитет;


&НаКлиенте
Процедура КартинкаФотоАналогаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = ""; 
	Фильтр = "Файл картинки (*.jpg);(*.png);(*.bmp)|*.jpg;*.png;*.bmp"; 
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберете файл для загрузки"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт 
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма); 
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); 
КонецПроцедуры

&НаКлиенте 
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли; 
	Если ЭтаФорма.ТекущийЭлемент.Имя = "КартинкаФотоАналога" Тогда
		КартинкаФотоАналога = Адрес; 
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "КартинкаРеференсУпаковки" Тогда
		КартинкаРеференсУпаковки = Адрес;
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "картинкаРеференсФотоСессии" Тогда
		картинкаРеференсФотоСессии = Адрес;
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "ДизайнМакетКартинка" Тогда
		ДизайнМакетКартинка = Адрес;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(КартинкаФотоАналога)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(КартинкаФотоАналога); 
		ТекущийОбъект.ФотоАналога = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(КартинкаФотоАналога); 
		//КартинкаФотоАналога = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ФотоАналога"); 
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(КартинкаРеференсУпаковки)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(КартинкаРеференсУпаковки); 
		ТекущийОбъект.РеференсУпаковки = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(КартинкаРеференсУпаковки); 
		//КартинкаРеференсУпаковки = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"РеференсУпаковки"); 
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(КартинкаРеференсФотоСессии)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(КартинкаРеференсФотоСессии); 
		ТекущийОбъект.РеференсФотоСессии = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(КартинкаРеференсФотоСессии); 
		//КартинкаРеференсФотоСессии = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"РеференсФотоСессии"); 
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(ДизайнМакетКартинка)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(ДизайнМакетКартинка); 
		ТекущийОбъект.ДизайнМакет = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(ДизайнМакетКартинка); 
		ДизайнМакетКартинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ДизайнМакет"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	КартинкаФотоАналога = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ФотоАналога");
	КартинкаРеференсУпаковки = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"РеференсУпаковки");
	КартинкаРеференсФотоСессии = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"РеференсФотоСессии");
	ДизайнМакетКартинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ДизайнМакет");
	ЗаписатьДанныеФормыВДокументАссортиментныйКомитет(ТекущийДокАссортиментныйКомитет);
	
	//Если Объект.Тайминг.Количество() < 1 И ЗначениеЗаполнено(Объект.Дата) Тогда
	//	ЗаполнитьПлановуюДатуТЧТаймигнга();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ОбновитьНумерациюОбъектов();
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.ТекущаяСтадияДокумента = 1;
		Объект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	КартинкаФотоАналога = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ФотоАналога");
	КартинкаРеференсУпаковки = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"РеференсУпаковки");
	КартинкаРеференсФотоСессии = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"РеференсФотоСессии");
	ДизайнМакетКартинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ДизайнМакет");
КонецПроцедуры


&НаКлиенте
Процедура КартинкаРеференсУпаковкиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = ""; 
	Фильтр = "Файл картинки (*.jpg);(*.png);(*.bmp)|*.jpg;*.png;*.bmp"; 
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберете файл для загрузки"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);
КонецПроцедуры


&НаКлиенте
Процедура картинкаРеференсФотоСессииНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = ""; 
	Фильтр = "Файл картинки (*.jpg);(*.png);(*.bmp)|*.jpg;*.png;*.bmp"; 
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберете файл для загрузки"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ДизайнМакетКартинкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = ""; 
	Фильтр = "Файл картинки (*.jpg);(*.png);(*.bmp)|*.jpg;*.png;*.bmp"; 
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберете файл для загрузки"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ИсходникиФотоСессийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.ИсходникиФотоСессий = ДиалогОткрытия.Каталог; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаПапкуАналитическихДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.СсылкаНаПапкуАналитическихДанных = ДиалогОткрытия.Каталог; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаПапкуХраненияСопроводительныхМатериаловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		СсылкаНаПапкуХраненияСопроводительныхМатериалов = ДиалогОткрытия.Каталог; 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПрезентацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.Презентации = ДиалогОткрытия.Каталог; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МакетыУпаковкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.МакетыУпаковки  = ДиалогОткрытия.Каталог; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИсходникиФотоСессийОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяФайла = СокрЛП(Элемент.ТекстРедактирования);
	ОткрытьПапкуПоПути(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ПрезентацииОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяФайла = СокрЛП(Элемент.ТекстРедактирования);
	ОткрытьПапкуПоПути(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаПапкуХраненияСопроводительныхМатериаловОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяФайла = СокрЛП(Элемент.ТекстРедактирования);
	ОткрытьПапкуПоПути(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура МакетыУпаковкиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИмяФайла = СокрЛП(Элемент.ТекстРедактирования);
	ОткрытьПапкуПоПути(ИмяФайла);
КонецПроцедуры


&НаКлиенте
Процедура СсылкаНаПапкуАналитическихДанныхОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ИмяФайла = СокрЛП(Элемент.ТекстРедактирования);
	ОткрытьПапкуПоПути(ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура  ОткрытьПапкуПоПути(ИмяФайла)
	 Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
    НачатьЗапускПриложения(Оповещение,ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт
        
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьРазработку(Команда)
	СтатусВыполнения = Перечисления.СтатусыАссортиментногоКомитета.ПрекратитьРазработку;
	ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("Документ", ТекущийДокАссортиментныйКомитет);
	ПараметрыОтбора.Вставить("Активен", Истина);
	НайденныеСтроки = Объект.АссортиментныйКомитет.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Стр Из НайденныеСтроки Цикл
		Стр.Статус = Перечисления.СтатусыАссортиментногоКомитета.ПрекратитьРазработку;
		//Стр.Активен = Ложь;
	КонецЦикла;
	ЗаписатьДанныеФормыВДокументАссортиментныйКомитет(ТекущийДокАссортиментныйКомитет);
	Объект.ТекущаяСтадияДокумента = 4;
	Записать();
	Элементы.ПрекратитьРазработку.ЦветФона = ЦветаСтиля.ЦветАкцента;
	Элементы.ПрекратитьРазработку.ЦветРамки = ЦветаСтиля.ЦветАкцента;
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКДоработке(Команда)
	СтатусВыполнения = Перечисления.СтатусыАссортиментногоКомитета.ПринятьКДороботке;
	ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("Документ", ТекущийДокАссортиментныйКомитет);
	ПараметрыОтбора.Вставить("Активен", Истина);
	НайденныеСтроки = Объект.АссортиментныйКомитет.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Стр Из НайденныеСтроки Цикл
		Стр.Статус = Перечисления.СтатусыАссортиментногоКомитета.ПринятьКДороботке;
		Стр.Активен = Ложь;
	КонецЦикла;
	ЗаписатьДанныеФормыВДокументАссортиментныйКомитет(ТекущийДокАссортиментныйКомитет);
	Записать();
	ТемаПисьма = "Решение Ассортиментного комитета по Разработке Номенклатуры: " + Объект.Номер + " от "+ Объект.Дата;
	ТекстПисьма = " АссортиментныйКомитет "+ ПериодПроведенияАссортиментногоКомитета+ " принял решение о необходимости доработки " + Объект.Номер + " от "+ Объект.Дата;  
	//ОповеститьИсполнителя(Объект.ОтветственноеЛицоПЗО,ТекстПисьма,ТемаПисьма);
	Элементы.ПринятьКДоработке.ЦветФона = ЦветаСтиля.ЦветАкцента;
	Элементы.ПринятьКДоработке.ЦветРамки = ЦветаСтиля.ЦветАкцента;
КонецПроцедуры

&НаКлиенте
Процедура ПринятьВПроизводство(Команда)
	//Если Не ЗначениеЗаполнено(ОтветственноеЛицоОтПЗО) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Для передачи заявки в производство нужно указать Ответственное лицо от ПЗО!";
	//	Сообщение.Поле = "ОтветственноеЛицоОтПЗО";
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	 СтатусВыполнения = Перечисления.СтатусыАссортиментногоКомитета.ПринятьВПоизводство;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Активен", Истина);
	НайденныеСтроки = Объект.АссортиментныйКомитет.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Стр Из НайденныеСтроки Цикл
		Стр.Статус = Перечисления.СтатусыАссортиментногоКомитета.ПринятьВПоизводство;
		Стр.Активен = Истина;
	КонецЦикла;
	ЗаписатьДанныеФормыВДокументАссортиментныйКомитет(ТекущийДокАссортиментныйКомитет);
	Записать();
	ТемаПисьма = "Решение Ассортиментного комитета по Разработке Номенклатуры в товарной категории: "+ Объект.ТоварнаяКатегория+ " по документу №  " + Объект.Номер + " от "+ Объект.Дата;
	ТекстПисьма = " АссортиментныйКомитет "+ ПериодПроведенияАссортиментногоКомитета+ " принял решение о передачи в производство " + Объект.Номер + " от "+ Объект.Дата;  
//	ОповеститьИсполнителя(ОтветственноеЛицоОтПЗО,ТекстПисьма,ТемаПисьма);
	Элементы.ПринятьВПроизводство.ЦветФона = ЦветаСтиля.ЦветАкцента;
	Элементы.ПринятьВПроизводство.ЦветРамки = ЦветаСтиля.ЦветАкцента;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДокументАссортиментныйКомитет() 
	
	Если Объект.АссортиментныйКомитет.Количество() > 0 Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Активен", Истина);
		НайденныеСтроки = Объект.АссортиментныйКомитет.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.количество() = 0 Тогда
			ДокАссортиментныйКомитет = Документы.АссортиментныйКомитет.СоздатьДокумент();
			ДокАссортиментныйКомитет.Дата = ТекущаяДатаСеанса();
			ДокАссортиментныйКомитет.Записать(РежимЗаписиДокумента.Проведение);
			НоваяСтрока = Объект.АссортиментныйКомитет.Добавить();
			НоваяСтрока.Документ = ДокАссортиментныйКомитет.Ссылка;
			НоваяСтрока.Активен = Истина;
		КонецЕсли;
		
		Для Каждого Стр Из НайденныеСтроки Цикл
			
			ДокАссортиментныйКомитет = Стр.Документ;
		КонецЦикла;
		
	Иначе
		ДокАссортиментныйКомитет = Документы.АссортиментныйКомитет.СоздатьДокумент();
		//ДокАссортиментныйКомитет.УстановитьНовыйНомер();
		ДокАссортиментныйКомитет.Дата = ТекущаяДатаСеанса();
		ДокАссортиментныйКомитет.Записать(РежимЗаписиДокумента.Проведение);
		НоваяСтрока = Объект.АссортиментныйКомитет.Добавить();
		НоваяСтрока.Документ = ДокАссортиментныйКомитет.Ссылка;
		НоваяСтрока.Активен = Истина;
	КонецЕсли;
	
	Возврат ДокАссортиментныйКомитет.Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗавершитьПервуюСтадию(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПлановыйПериодПроведенияАссортиментногоКомитета) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите Плановую Дату, для завершения этапа Разработки!";
		Сообщение.Поле = "ПлановыйПериодПроведенияАссортиментногоКомитета";
		Сообщение.Сообщить();
	Иначе
		Объект.ТекущаяСтадияДокумента = 2;
		Записать();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВторуюСтадию(Команда)
	
		Объект.ТекущаяСтадияДокумента = 3;
		Записать();
	    ТемаПисьма = "Итоги Ассортиментного комитета по Заявке на разработку ассортимента в товарной категории: "+ Объект.ТоварнаяКатегория+ " по документу № " + Объект.Номер + " от "+ Объект.Дата;
		ТекстПисьма = " Пользователь "+ СокрЛП(ПараметрыСеанса.Пользователь)+ "Назначил исполнителем первого этапа Разработки номенклатуры № " + Объект.Номер + " от "+ Объект.Дата;  
	//	ОповеститьИсполнителя(ОтветственноеЛицоОтПЗО,ТекстПисьма,ТемаПисьма);
		Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.ТекущаяСтадияДокумента) Тогда 
		Объект.ТекущаяСтадияДокумента = 1;
	КонецЕсли;
	ТекущийДокАссортиментныйКомитет = ПолучитьДокументАссортиментныйКомитет();
	ПолучитьДанныеДокументаАссортиментныйКомитетВФорму(ТекущийДокАссортиментныйКомитет);
//	ЗаполнитьЗначенияСвойств(ЭтаФорма,ТекущийДокАссортиментныйКомитет,);
	Элементы.СтраницаАссортиментныйКомитет.Заголовок = СокрЛП(Элементы.СтраницаАссортиментныйКомитет.Заголовок) + " (" + Объект.АссортиментныйКомитет.Количество()+")";
	УправлениеВидимостью(); 
	
	//Если Объект.Тайминг.Количество() < 1 И ЗначениеЗаполнено(Объект.Дата) Тогда
	//	ЗаполнитьПлановуюДатуТЧТаймигнга();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура  УправлениеВидимостью()
	
		Элементы.СтраницаАссортиментныйКомитет.ТолькоПросмотр = Истина;
		Элементы.СтраницаЗаявка.ТолькоПросмотр = Истина;
		Элементы.СтраницаПодготовкаКПродаже.ТолькоПросмотр = Истина;
		Если Объект.ТекущаяСтадияДокумента < 2 Тогда
			Элементы.СтраницаЗаявка.ТолькоПросмотр = Ложь;
		ИначеЕсли Объект.ТекущаяСтадияДокумента = 2 Тогда
			Элементы.СтраницаАссортиментныйКомитет.ТолькоПросмотр = Ложь;
		ИначеЕсли Объект.ТекущаяСтадияДокумента = 3 Тогда
			Элементы.СтраницаПодготовкаКПродаже.ТолькоПросмотр = Ложь;
		ИначеЕсли Объект.ТекущаяСтадияДокумента = 4 Тогда  
 			Элементы.СтрокаСостоянияДокумента.Видимость = Истина;
			Элементы.СтрокаСостоянияДокумента.Заголовок = "Разработка прекращена решением Ассортиментного Комитета!";
			Элементы.СтрокаСостоянияДокумента.Шрифт = ШрифтыСтиля.ШрифтВажнойНадписи;
			Элементы.СтрокаСостоянияДокумента.ЦветТекста = ЦветаСтиля.КрасныйЦвет;
		КонецЕсли;
	//Элементы.ГруппаТайминга.Доступность = НЕ ЗначениеЗаполнено(Объект.ГруппаТайминга);
	//Если НЕ РольДоступна("Администратор") ИЛИ НЕ РольДоступна("МенеджерПоСнабжению") Тогда
	//	Элементы.Фабрика.Доступность = НЕ ЗначениеЗаполнено(Объект.Фабрика);
	//КонецЕсли;
	
	МожноВидетьТайминг = ПользовательИзПодразеденияОтделаЗакупок(ПараметрыСеанса.Пользователь);
	Если НЕ МожноВидетьТайминг  И НЕ РольДоступна("Администратор") Тогда
		Элементы.СтраницаТайминга.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыпускВПродажу(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Модель) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните разработанную данной заявкой модель перед выпуском в продажу!";
		Сообщение.Поле = Элементы.Модель; 
		//Сообщение.ПутьКДанным = Элементы.Модель;
		Сообщение.Сообщить();
	Иначе   
		Объект.ТекущаяСтадияДокумента = 5;
		Записать();
		Закрыть();
		
		ТемаПисьма = "Готов к продаже артикул "+Объект.Артикул+" по Заявке на разработку ассортимента в товарной категории: "+ Объект.ТоварнаяКатегория+ " по документу № " + Объект.Номер + " от "+ Объект.Дата;
		ТекстПисьма = "Готов к продаже артикул "+Объект.Артикул+" по Заявке на разработку ассортимента в товарной категории: "+ Объект.ТоварнаяКатегория+ " по документу № " + Объект.Номер + " от "+ Объект.Дата;  
		СписокПолучателей = Новый СписокЗначений;
		Для каждого Стр Из ПодразделенияПродаж Цикл
			СписокПолучателей.Добавить(Стр.Руководитель.ЕМэйл);
		КонецЦикла;
		ОповеститьИсполнителя(СписокПолучателей,ТекстПисьма,ТемаПисьма);  
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура НачатьРазработку(Команда)  
	//Валетов + 14,03,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9160
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	//Валетов -
	Если ЗначениеЗаполнено(Объект.ОтветственноеЛицоПЗО) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Не указан Ответственный ПЗО! Письмо с оповещением Не будет сформировано!";
	//	Сообщение.Поле = "Объект.ОтветственноеЛицоПЗО";
	//	Сообщение.Сообщить();
	
		ТемаПисьма = "Создана заявка на разработку ассортимента в товарной категории: "+ Объект.ТоварнаяКатегория+ " по документу № " + Объект.Номер + " от "+ Объект.Дата;
		ТекстПисьма = "Создана заявка на разработку ассортимента в товарной категории: "+ Объект.ТоварнаяКатегория+ " по документу № " + Объект.Номер + " от "+ Объект.Дата;  
		ОповеститьИсполнителя(Объект.ОтветственноеЛицоПЗО,ТекстПисьма,ТемаПисьма);  
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите ОтветственноеЛицоПЗО для отправки письма!";
		Сообщение.Поле = "ОтветственноеЛицоПЗО";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОповеститьИсполнителя(Пользователь,ТекстПисьма,ТемаПисьма)
	Если ТипЗнч(Пользователь) = Тип("СписокЗначений") Тогда
		СписокПолучателей = Пользователь.Скопировать();
	Иначе
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.Добавить(Пользователь.ЕМэйл);
	КонецЕсли;
	СписокПолучателей.Добавить(ПараметрыСеанса.Пользователь.ФизЛицо.ЕМэйл);
	СформироватьВнутреннееУведомление(СписокПолучателей,ТекстПисьма,ТемаПисьма,Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеФормыВДокументАссортиментныйКомитет(ТекущийДокАссортиментныйКомитет)
	ОбъектДляЗаписи = ТекущийДокАссортиментныйКомитет.ПолучитьОбъект();
	ОбъектДляЗаписи.КоличествоВЗаказе 			= КоличествоВЗаказе;
	ОбъектДляЗаписи.ПериодПоставкиНаСклад		= ПериодПоставкиНаСклад;
	ОбъектДляЗаписи.РРЦ                         = РРЦ;
	ОбъектДляЗаписи.Комментарий					= Комментарий;
	ОбъектДляЗаписи.ОтветственноеЛицоОтПЗО		= ОтветственноеЛицоОтПЗО;
	ОбъектДляЗаписи.СсылкаНаКартинку			= ДизайнМакетКартинка;
	ОбъектДляЗаписи.КоличествоПлана 			= КоличествоПлана;
	ОбъектДляЗаписи.ПараметрыПлана		        = ПараметрыПлана;
//	ФайлКартинки = ПоместитьВоВременноеХранилище(ДизайнМакетКартинка); 
////	ТекущийОбъект.РеференсФотоСессии = Новый ХранилищеЗначения(ФайлКартинки); 
////	УдалитьИзВременногоХранилища(КартинкаРеференсФотоСессии);
//		
//	ОбъектДляЗаписи.ДизайнМакет					= Новый ХранилищеЗначения(ФайлКартинки);
//	УдалитьИзВременногоХранилища(ФайлКартинки);
	
	ОбъектДляЗаписи.ПериодПроведенияАссортиментногоКомитета = ПериодПроведенияАссортиментногоКомитета;
	ОбъектДляЗаписи.СтатусВыполнения = СтатусВыполнения;
	ОбъектДляЗаписи.ПодразделенияПродаж.Загрузить(ПодразделенияПродаж.Выгрузить());
	ОбъектДляЗаписи.ПараметрыТовара.Загрузить(ПараметрыТовара.Выгрузить());
	ОбъектДляЗаписи.СписокУчастников.Загрузить(СписокУчастников.Выгрузить());
	ОбъектДляЗаписи.ПапкиХраненияМатериалов.Загрузить(ПапкиХраненияМатериалов.Выгрузить());
	
	ОбъектДляЗаписи.Записать();

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДокументаАссортиментныйКомитетВФорму(ТекущийДокАссортиментныйКомитет)
	КоличествоВЗаказе 			= ТекущийДокАссортиментныйКомитет.КоличествоВЗаказе;
	ПериодПоставкиНаСклад		= ТекущийДокАссортиментныйКомитет.ПериодПоставкиНаСклад;
	РРЦ                         = ТекущийДокАссортиментныйКомитет.РРЦ;
	КоличествоПлана				= ТекущийДокАссортиментныйКомитет.КоличествоПлана;
	ПараметрыПлана              = ТекущийДокАссортиментныйКомитет.ПараметрыПлана;
	ПодразделенияПродаж.Загрузить(ТекущийДокАссортиментныйКомитет.ПодразделенияПродаж.Выгрузить());
	ПараметрыТовара.Загрузить(ТекущийДокАссортиментныйКомитет.ПараметрыТовара.Выгрузить());
	СписокУчастников.Загрузить(ТекущийДокАссортиментныйКомитет.СписокУчастников.Выгрузить());
	ПапкиХраненияМатериалов.Загрузить(ТекущийДокАссортиментныйКомитет.ПапкиХраненияМатериалов.Выгрузить());
	Комментарий					= ТекущийДокАссортиментныйКомитет.Комментарий;
	ОтветственноеЛицоОтПЗО		= ТекущийДокАссортиментныйКомитет.ОтветственноеЛицоОтПЗО;
	ПериодПроведенияАссортиментногоКомитета = ТекущийДокАссортиментныйКомитет.ПериодПроведенияАссортиментногоКомитета;
	СтатусВыполнения = ТекущийДокАссортиментныйКомитет.СтатусВыполнения;
КонецПроцедуры

&НаКлиенте
Процедура ПапкиХраненияМатериаловВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		Элемент.ТекущиеДанные.Папка = ДиалогОткрытия.Каталог; 
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура История(Команда)
	ИсторияНаСервере();
	Элементы.Результат.Видимость = НЕ Элементы.Результат.Видимость; 
КонецПроцедуры

&НаСервере
Процедура ИсторияНаСервере() экспорт
	
	СхемаКомпоновкиДанных = Документы.РазработкаНовойНоменклатуры.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	МакетКомпоновки.ЗначенияПараметров.ДокРазработки.Значение = Объект.Ссылка;
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Элементы.Результат;
	Результат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМодель(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Артикул) Тогда
		НовМодель = Справочники.Номенклатура.СоздатьГруппу();
		НовМодель.ЭтоМодель = Истина;
		//НовМодель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар;
		//НовМодель.Брэнд = Объект.Брэнд;
		НовМодель.Наименование = Объект.НаименованиеАртикула;
		НовМодель.Записать();
		ФормаВвода = НовМодель.ПолучитьФорму("УстановкаРеквизитов",НовМодель);
		ФормаВвода.ЭлементыФормы.Брэнд.Значение = Объект.Брэнд;
		ФормаВвода.ЭлементыФормы.БрендДляСайта.Значение = Объект.Брэнд;
		ФормаВвода.ЭлементыФормы.ПоловозрастнойПризнак.Значение = Объект.ПолоВозрастнойПризнак;
		ФормаВвода.Владелец = НовМодель.Ссылка;
		ФормаВвода.ОткрытьМодально();
		Объект.Артикул = НовМодель.Ссылка;
	Иначе
		Объект.Артикул.ПолучитьФорму().Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрезентацииПриИзменении(Элемент)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		Элемент.ТекущиеДанные.Папка = ДиалогОткрытия.Каталог; 
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ИсходникиФотоСессийПриИзменении(Элемент)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		Элемент.ТекущиеДанные.Папка = ДиалогОткрытия.Каталог; 
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура МакетыУпаковкиПриИзменении(Элемент)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	Если ДиалогОткрытия.Выбрать() Тогда 
		Элемент.ТекущиеДанные.Папка = ДиалогОткрытия.Каталог; 
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура РазмерныеРядыПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Размер) и Элемент.ТекущиеДанные.Размер.ЭтоГруппа Тогда
		 ЗаполнитьСтрокиРазмера(Элемент.ТекущиеДанные.Размер);
		 Элемент.ТекущиеДанные.Размер = Справочники.Размеры.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиРазмера(Размер)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Размеры.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.Размеры КАК Размеры
	                |ГДЕ
	                |	НЕ Размеры.ЭтоГруппа
	                |	И Размеры.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель",Размер);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.СписокРазмеров.Добавить();
		НовСтр.размер = Выборка.Ссылка;
	КонецЦикла;
	
	
КонецПроцедуры


&НаСервере
Процедура СписокУчастниковПриИзмененииНаСервере(ГруппаФЛ)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ФизическиеЛица.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                |ГДЕ
	                |	НЕ ФизическиеЛица.ЭтоГруппа
	                |	И ФизическиеЛица.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель",ГруппаФЛ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтр = СписокУчастников.Добавить();
		НовСтр.Участник = Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СписокУчастниковПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Участник) и Элемент.ТекущиеДанные.Участник.ЭтоГруппа Тогда
		 СписокУчастниковПриИзмененииНаСервере(Элемент.ТекущиеДанные.Участник);
		 Элемент.ТекущиеДанные.Участник = Справочники.Участник.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановуюДатуТЧТаймигнга()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЭтапыРазработкиНоменклатуры.Ссылка КАК Ссылка,
	                |	ЭтапыРазработкиНоменклатуры.НомерЭтапа КАК НомерЭтапа,
	                |	ЭтапыРазработкиНоменклатуры.Длительность КАК Длительность
	                |ИЗ
	                |	Справочник.ЭтапыРазработкиНоменклатуры КАК ЭтапыРазработкиНоменклатуры
	                |ГДЕ
	                |	НЕ ЭтапыРазработкиНоменклатуры.ПометкаУдаления
	                |	И ЭтапыРазработкиНоменклатуры.Ссылка В ИЕРАРХИИ(&Этап)
	                |	И НЕ ЭтапыРазработкиНоменклатуры.ЭтоГруппа
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	НомерЭтапа";
	Запрос.УстановитьПараметр("Этап",Объект.ГруппаТайминга);
	Выборка = Запрос.Выполнить().Выбрать();
	ДатаПрошлогоЭтапа = Неопределено;
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.Тайминг.Добавить();
		НовСтр.ЭтапРазработки = Выборка.Ссылка; 
		Если ЗначениеЗаполнено(Объект.Дата) Тогда
			КоличествоДней = Число(Выборка.Длительность) * 86400;
			Если ДатаПрошлогоЭтапа  = Неопределено Тогда				
				НовСтр.ПлановаяДата = Объект.Дата + КоличествоДней;
				НовСтр.РасчетнаяДата = НовСтр.ПлановаяДата;
			Иначе
				НовСтр.ПлановаяДата = ДатаПрошлогоЭтапа + КоличествоДней;
				НовСтр.РасчетнаяДата = НовСтр.ПлановаяДата;
			КонецЕсли;
			ДатаПрошлогоЭтапа = НовСтр.ПлановаяДата;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаТаймингаПриИзменении(Элемент)
	Если Объект.Тайминг.Количество() = 0 Тогда
		ЗаполнитьПлановуюДатуТЧТаймигнга(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаймингФактическаяДатаПриИзменении(Элемент)
	ТекСтрока = Элементы.Тайминг.ТекущиеДанные;  
	НоваяДата = ТекСтрока.ФактическаяДата;
	Для Каждого Стр из Объект.Тайминг Цикл
		Если Стр.НомерСтроки > ТекСтрока.номерстроки Тогда 
			РасчетнаяДлительность = ПолучитьДлительностьТаймингаПоМаршруту(Объект.Маршрут,СТр.ЭтапРазработки);
			КоличествоДней = Число(РасчетнаяДлительность) * 86400;
			Стр.РасчетнаяДата = НоваяДата + КоличествоДней; 
			НоваяДата = Стр.РасчетнаяДата;
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФабрикаПриИзменении(Элемент)
	Если Объект.Тайминг.Количество() = 0 Тогда
		ЗаполнитьПлановуюДатуТЧТаймингаПоМаршруту(); 
	КонецЕсли;
КонецПроцедуры       

&НаСервере
Процедура ЗаполнитьПлановуюДатуТЧТаймингаПоМаршруту()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЭтапыРазработкиНоменклатурыДанные.Ссылка КАК Ссылка,
	                |	ЭтапыРазработкиНоменклатурыДанные.Длительность КАК Длительность,
	                |	ЭтапыРазработкиНоменклатурыДанные.Ссылка.НомерЭтапа КАК НомерЭтапа,
	                |	ЭтапыРазработкиНоменклатурыДанные.Отдел КАК Отдел
	                |ИЗ
	                |	Справочник.ЭтапыРазработкиНоменклатуры.Данные КАК ЭтапыРазработкиНоменклатурыДанные
	                |ГДЕ
	                |	ЭтапыРазработкиНоменклатурыДанные.Маршрут = &Маршрут
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	НомерЭтапа";
	Запрос.УстановитьПараметр("Маршрут",Объект.Маршрут);
	Выборка = Запрос.Выполнить().Выбрать();
	ДатаПрошлогоЭтапа = Неопределено;
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.Тайминг.Добавить();
		НовСтр.ЭтапРазработки = Выборка.Ссылка;
		НовСтр.Отдел = Выборка.Отдел;
		НовСтр.Статус = Перечисления.СостоянияДляЗаявок.ВРаботе;
		Если ЗначениеЗаполнено(Объект.Дата) Тогда
			КоличествоДней = Число(Выборка.Длительность) * 86400;
			Если ДатаПрошлогоЭтапа  = Неопределено Тогда				
				НовСтр.ПлановаяДата = Объект.Дата + КоличествоДней;
				НовСтр.РасчетнаяДата = НовСтр.ПлановаяДата;
			Иначе
				НовСтр.ПлановаяДата = ДатаПрошлогоЭтапа + КоличествоДней;
				НовСтр.РасчетнаяДата = НовСтр.ПлановаяДата;
			КонецЕсли;
			ДатаПрошлогоЭтапа = НовСтр.ПлановаяДата;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьДлительностьТаймингаПоМаршруту(МаршрутЗапроса,ЭтапЗапроса)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЭтапыРазработкиНоменклатурыДанные.Ссылка КАК Ссылка,
	                |	ЭтапыРазработкиНоменклатурыДанные.Длительность КАК Длительность,
	                |	ЭтапыРазработкиНоменклатурыДанные.Отдел КАК Отдел
	                |ИЗ
	                |	Справочник.ЭтапыРазработкиНоменклатуры.Данные КАК ЭтапыРазработкиНоменклатурыДанные
	                |ГДЕ
	                |	ЭтапыРазработкиНоменклатурыДанные.Маршрут = &Маршрут
	                |	И ЭтапыРазработкиНоменклатурыДанные.Ссылка = &Этап";
	Запрос.УстановитьПараметр("Маршрут",МаршрутЗапроса);
	Запрос.УстановитьПараметр("Этап",ЭтапЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда
        Возврат Выборка.Длительность;
	Иначе 
		Возврат 0;
	КонецЕсли; 	
	
КонецФункции

&НаСервере
Функция ПользовательИзПодразеденияОтделаЗакупок(Пользователь) 

	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	Подразделения.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.Подразделения КАК Подразделения
	                |ГДЕ
	                |	Подразделения.Ссылка В ИЕРАРХИИ(&ПодразделениеДЗП)
	                |	И НЕ Подразделения.ПометкаУдаления
	                |	И НЕ Подразделения.ЭтоГруппа";
	Запрос.УстановитьПараметр("ПодразделениеДЗП",Справочники.Подразделения.НайтиПоКоду("GRP-0436")); // Департамент закупок и производства
	//	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивПодразделений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивПодразделений.Добавить(Справочники.Подразделения.НайтиПоКоду("SSP-0355"));  //Отдел категорийных менеджеров
	Если МассивПодразделений.Найти(Пользователь.ФизЛицо.Подразделение) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТаймингПередУдалением(Элемент, Отказ)
	Контекст = Новый Структура;
	Контекст.Вставить("ТекЭлемент" , Элементы.Тайминг.ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект,Контекст); 
	ПоказатьВопрос(Оповещение, "Точно нужно удалить текущую строку???",РежимДиалогаВопрос.ДаНетОтмена);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт 

	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
